# SQL
---

In [ ]:
"""
CRUD

Create
Alter
Drop (Table or DB이름)
Insert into (테이블이름) valuse (data1, data2,,) : 테이블에 새로운 값 추가
Update (테이블이름) set (수정내용) where (조건)
Delete from (테이블이름) where (조건)   - Drop은 전체삭제, 얘는 데이터삭제
Select (필드) from (테이블이름) where (조건)

WHERE절 : {컬럼} = {값};  / {컬럼} IN {값}
JOIN : 여러 테이블의 컬럼을 조합하여 하나로 보여줌. 
        MYSQL에선 Left, Right조인으로 Full만들 수 있음.(파이선 Merge에서도 사용)
    >   Select A.컬1, A.컬2, B.컬1, B.컬2
        From A LEFT JOIN B
        ON A.key = B.key
ORDER BY : Select * from (테이블명) order by (컬럼명) asc/desc
GROUP BY : 특정 컬럼을 기준으로 그룹화
    ㄴ HAVING : 그룹화한 결과에 조건을 건다.
    >     Select * from (테이블명) group by (그룹화할 컬럼)
    >응용: Select * from (테이블명) where (조건) group by (그룹화할 컬럼) having (조건) order by (컬럼)

"""

In [ ]:
"""
mysql -u root -p
create database ubion;
use ubion;

/opt/homebrew/var/mysql/JMMacui-MacBookAir.local.pid
"""

In [ ]:
"""
[테이블 생성]
mysql> create table DEPT (
    -> 
    -> DEPTNO int primary key,
    -> DNAME varchar(32),
    -> LOC varchar(32)
    -> );

[값 삽입]
mysql> insert into DEPT values (10, "accounting", "new york"),
    -> (20, "research","dallas"), (40, "operations", "boston");
    -> insert into DEPT values (30, "SALES", "CHICAGO");
"""

In [ ]:
[테이블 생성]
mysql> create table EMP (
    -> 
    -> EMPNO int primary key,
    ->  ENAME varchar(16),
    ->  JOB varchar(16),
    ->  MGR int,
    ->  HIREDATE int,
    ->  SAL int,
    ->  COMM int,
    ->  DEPTNO int
    -> );
    
[EMP의 EMPNO컬럼 이름을 EMPNO_reaname으로 바꾸려면]
> alter table EMP rename column EMPNO to EMPNO_rename;
> alter table EMP change column EMPNO EMPNO_rename int;

[value삽입]
mysql> insert into EMP values (1111, "Kim", "CEO", 1234, 20200101, 1000, NULL, 10),
    -> (2222, "Lee", "salesman", 2222, 20200503. 300, NULL, 20),
    -> (3333,"Choi", "manager", 3333, 20200303, 400, NULL, 30),
    -> (4444, "Park", "analyst", 4444, 20200705, 200, NULL, 40);

In [ ]:
[값 삭제]
DELETE * from EMP where

[테이블 구조확인] - desc
> DESC EMP

[테이블 내부확인]
> select * from EMP

[조건 조회]
> select * from EMP where SAL > 300;
> select * from EMP where SAL in (300, 1000);

[이름으로 필터링] - like
> select * from EMP where ENAME like "%K%"; : 가운데에 K가 있는 행 출력
> select * from EMP where ENAME like "%K"; : 맨 뒤에 K가 있는 행 출력

mysql> insert into EMP values (9999, "Seo", "manager", 1111, 20200101, 500, 200, 50);
Query OK, 1 row affected (0.01 sec)

mysql> select * from EMP;
+-------+-------+----------+------+----------+------+------+--------+
| EMPNO | ENAME | JOB      | MGR  | HIREDATE | SAL  | COMM | DEPTNO |
+-------+-------+----------+------+----------+------+------+--------+
|  1111 | Kim   | CEO      | 1234 | 20200101 | 1000 | NULL |     10 |
|  2222 | Lee   | salesman | 2222 | 20200503 |  300 | NULL |     20 |
|  3333 | Choi  | manager  | 3333 | 20200303 |  400 | NULL |     30 |
|  4444 | Park  | analyst  | 4444 | 20200705 |  200 | NULL |     40 |
|  9999 | Seo   | manager  | 1111 | 20200101 |  500 |  200 |     50 |
+-------+-------+----------+------+----------+------+------+--------+

mysql> select * from DEPT;
+--------+------------+----------+
| DEPTNO | DNAME      | LOC      |
+--------+------------+----------+
|     10 | accounting | new york |
|     20 | research   | dallas   |
|     30 | SALES      | CHICAGO  |
|     40 | operations | boston   |
+--------+------------+----------+
4 rows in set (0.00 sec)

[left join]
>   select EMP.EMPNO, EMP.ENAME, EMP.JOB, EMP.DEPTNO, DEPT.DEPTNO, DEPT.DNAME, DEPT.LOC
    from EMP left join DEPT
    on EMP.DEPTNO = DEPT.DEPTNO;

"""
+-------+----------+--------+--------+------------+----------+
| ENAME | JOB      | DEPTNO | DEPTNO | DNAME      | LOC      |
+-------+----------+--------+--------+------------+----------+
| Kim   | CEO      |     10 |     10 | accounting | new york |
| Lee   | salesman |     20 |     20 | research   | dallas   |
| Choi  | manager  |     30 |     30 | SALES      | CHICAGO  |
| Park  | analyst  |     40 |     40 | operations | boston   |
| Seo   | manager  |     50 |   NULL | NULL       | NULL     |
+-------+----------+--------+--------+------------+----------+
"""

DEPTNO를 기준으로 EMP 왼쪽쪼인을 했을 때,
EMP.DEPTNO에는 50이 살아있고, DEPT.DEPTNO에는 50대신에 NULL이 뜬다.
따라서 NULL을 안띄우게 할려면,
select를 할 때의 조건대상 컬럼이 더 넓은 테이블로 컬럼을 출력한다.(여기선 EMP에 50인 데이터가 하나 더 있다.)